Track/request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v8="http://fedex.com/ws/track/v8">
   <soapenv:Body>
      <v8:TrackRequest>
         <v8:WebAuthenticationDetail>
            <v8:UserCredential>
               <v8:Key/>
               <v8:Password>1iCABDnm7g4aWMTb0x7Q2WqvX</v8:Password>
            </v8:UserCredential>
         </v8:WebAuthenticationDetail>
         <v8:ClientDetail>
            <v8:AccountNumber>510088000</v8:AccountNumber>
            <v8:MeterNumber>118576342</v8:MeterNumber>
            <!--Optional:-->
            <v8:IntegratorId>gero et</v8:IntegratorId>
            <!--Optional:-->
            <v8:Localization>
               <v8:LanguageCode>EN</v8:LanguageCode>
               <!--Optional:-->
               <v8:LocaleCode>us</v8:LocaleCode>
            </v8:Localization>
         </v8:ClientDetail>
         <!--Optional:-->
         <v8:TransactionDetail>
            <!--Optional:-->
            <v8:CustomerTransactionId>sonoras imperio</v8:CustomerTransactionId>
            <!--Optional:-->
            <v8:Localization>
               <v8:LanguageCode>EN</v8:LanguageCode>
               <!--Optional:-->
               <v8:LocaleCode>us</v8:LocaleCode>
            </v8:Localization>
         </v8:TransactionDetail>
         <v8:Version>
            <v8:ServiceId>trck</v8:ServiceId>
            <v8:Major>8</v8:Major>
            <v8:Intermediate>0</v8:Intermediate>
            <v8:Minor>0</v8:Minor>
         </v8:Version>
         <!--Zero or more repetitions:-->
         <v8:SelectionDetails>
            <!--Optional:-->
            <v8:CarrierCode>FDXG</v8:CarrierCode>
            <!--Optional:-->
            <v8:OperatingCompany>FEDEX_CUSTOM_CRITICAL</v8:OperatingCompany>
            <!--Optional:-->
            <v8:PackageIdentifier>
               <v8:Type>GROUP_MPS</v8:Type>
               <v8:Value>temperat iras</v8:Value>
            </v8:PackageIdentifier>
            <!--Optional:-->
            <v8:TrackingNumberUniqueIdentifier>turbine corripuit</v8:TrackingNumberUniqueIdentifier>
            <!--Optional:-->
            <v8:ShipDateRangeBegin>2013-12-21+10:00</v8:ShipDateRangeBegin>
            <!--Optional:-->
            <v8:ShipDateRangeEnd>2017-05-15</v8:ShipDateRangeEnd>
            <!--Optional:-->
            <v8:ShipmentAccountNumber>regemque dedit</v8:ShipmentAccountNumber>
            <!--Optional:-->
            <v8:SecureSpodAccount>fremunt celsa</v8:SecureSpodAccount>
            <!--Optional:-->
            <v8:Destination>
               <!--Zero or more repetitions:-->
               <v8:StreetLines>ferant rapidi</v8:StreetLines>
               <!--Optional:-->
               <v8:City>sceptra tenens</v8:City>
               <!--Optional:-->
               <v8:StateOrProvinceCode>turbine corripuit scopuloque</v8:StateOrProvinceCode>
               <!--Optional:-->
               <v8:PostalCode>flammato secum dea</v8:PostalCode>
               <!--Optional:-->
               <v8:UrbanizationCode>profundum quippe ferant</v8:UrbanizationCode>
               <!--Optional:-->
               <v8:CountryCode>nubibus ignem disiecitque</v8:CountryCode>
               <!--Optional:-->
               <v8:CountryName>ac vinclis et</v8:CountryName>
               <!--Optional:-->
               <v8:Residential>false</v8:Residential>
            </v8:Destination>
            <!--Optional:-->
            <v8:PagingDetail>
               <!--Optional:-->
               <v8:PagingToken>ac vinclis</v8:PagingToken>
               <!--Optional:-->
               <v8:NumberOfResultsPerPage>200</v8:NumberOfResultsPerPage>
            </v8:PagingDetail>
            <!--Optional:-->
            <v8:CustomerSpecifiedTimeOutValueInMilliseconds>200</v8:CustomerSpecifiedTimeOutValueInMilliseconds>
         </v8:SelectionDetails>
         <!--Optional:-->
         <v8:TransactionTimeOutValueInMilliseconds>200</v8:TransactionTimeOutValueInMilliseconds>
         <!--Zero or more repetitions:-->
         <v8:ProcessingOptions>INCLUDE_DETAILED_SCANS</v8:ProcessingOptions>
      </v8:TrackRequest>
   </soapenv:Body>
</soapenv:Envelope>